posts/imposter-syndrome.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
</head>
<body>
<nav id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/">Home</a> |
<a href="/sitemap.html" align="right">Posts</a> |
<a href="/about.html">About</a> |
<a href="/repository.html">Repository</a>

</p>
</nav>
<main id="content">
<div id="outline-container-org0b312b2" class="outline-2">
<h2 id="org0b312b2">Imposter Syndrome : Formula for Success&#xa0;&#xa0;&#xa0;<span class="tag"><span class="phenomenon">phenomenon</span>&#xa0;<span class="success">success</span>&#xa0;<span class="skill">skill</span>&#xa0;<span class="imposter">imposter</span>&#xa0;<span class="psychology">psychology</span></span></h2>
<div class="outline-text-2" id="text-org0b312b2">
<ul class="org-ul">
<li>Have you ever felt a fear of losing or doubt your own ability?</li>
<li>Have you felt unworthy, lost your self esteem due to a mistake?</li>
<li>Are you feeling constant fear of being discovered rather than being proud?</li>
</ul>

<p>
The matter is, is these sound true or happening at some moment, let me condition it as <b>"Imposted Syndrome"</b>.
</p>

<p>
You might remember the word "Imposter" from the most popular mobile game during lockdown, <b>Among us</b> (<a href="https://www.innersloth.com/games/among-us/">site</a>), yeah as the name suggests it means one who deceives.
</p>

<p>
But imposter syndrome is seriously for real, a condition, which people do experience in their life. They don't usually realize or find its symptoms as it is in itself a <span class="underline">negative feeling</span>, provoking <a href="https://www.psychologytoday.com/intl/basics/anxiety">anxiety</a> and <a href="https://www.psychologytoday.com/intl/basics/fear">fear</a>.
</p>


<ul class="org-ul">
<li>People with imposter syndrome feel inauthentic, question their own ability to be</li>
</ul>
<p>
successful, and are convinced that they do not belong in the roles they stand, even
when they experience success.
</p>

<p>
I myself have felt this, when I was starting out journey to learn new course (say programming language), I felt it was oceanic knowledge where I only had a boat.
</p>
</div>

<div id="outline-container-org1f7c05d" class="outline-3">
<h3 id="org1f7c05d">Ways to stop Imposter Syndrome</h3>
<div class="outline-text-3" id="text-org1f7c05d">
<blockquote>
<p>
<i>Where there is a will, there is a way.</i>
</p>
</blockquote>
</div>


<div id="outline-container-orge7e355b" class="outline-4">
<h4 id="orge7e355b">Trust the Process</h4>
<div class="outline-text-4" id="text-orge7e355b">
<p>
Reflect on your actions, see the world praising you. Instead of listening to the negative feeling from your head, listen to the feedback from others.
</p>

<ul class="org-ul">
<li>Others believe in you</li>
<li>You don't believe in yourself</li>
<li>Yet you believe yourself instead of them</li>
</ul>

<p>
If you doubt yourself, shouldn't you also doubt your judgment of yourself?
</p>
</div>
</div>

<div id="outline-container-org9d2b260" class="outline-4">
<h4 id="org9d2b260">Look for Evidence</h4>
<div class="outline-text-4" id="text-org9d2b260">
<p>
Fine you feel it that way, see if you can find evidence and measures. Think of some example where you have made some positive impact on others, how much change have you brought them.
</p>
</div>
</div>

<div id="outline-container-org90df6ff" class="outline-4">
<h4 id="org90df6ff">Remember the Journey</h4>
<div class="outline-text-4" id="text-org90df6ff">
<p>
Look back at the steps you have taken, how was the process of learning from scratch, rock-bottom.
</p>

<p>
<i>'It will get better and you'll be more proud of yourself.'</i>
</p>
</div>
</div>

<div id="outline-container-orgf9a10f0" class="outline-4">
<h4 id="orgf9a10f0">Turn the Tables</h4>
<div class="outline-text-4" id="text-orgf9a10f0">
<p>
Make it a strenth, refrain from doubts. Those with imposter syndrome are more likely to say "I don't know" when they don't know. This is an advantage. Overconfident people assume they have all the answers, even when they don't.
</p>

<p>
Humility, uncertainty, and self-doubt are part of the learning process. The key is to believe in your ability to learn.
</p>
</div>
</div>


<div id="outline-container-org11c26c0" class="outline-4">
<h4 id="org11c26c0">Suggested Reads</h4>
<div class="outline-text-4" id="text-org11c26c0">
<p>
If you want to explore more on this concepts :
</p>

<ol class="org-ol">
<li><a href="https://www.psychologytoday.com/intl/blog/all-kids-thriving/202302/the-power-of-belonging">The Power of Belonging</a></li>

<li><a href="https://www.psychologytoday.com/intl/blog/on-your-way-with-adhd/202302/the-connection-between-adhd-and-imposter-syndrome">Connection between ADHD and Imposter Syndrome</a></li>
</ol>
</div>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
2023 - <b>Dilip<sup></sup></b>- Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</footer>
</body>
</html>
